{
    "nav": {
        "nav1": "School Resources",
        "nav2": "Curriculum Resources",
        "nav3": "Become a Member ",
        "nav4": "Contribution Resources",
        "nav5": "Log in",
        "nav6": "Register",
        "nav7": "Personal Information",
        "nav8": "See the reply",
        "nav9": "Log out"
    },
    "home": {
        "title1": "Find your school and your curriculum",
        "title2": "Obtain accurate and efficient QUIZ solutions easily",
        "input": "Inquire your classes or schools, such as the University of California",
        "con1": "Curriculum",
        "con2": "Question  Set",
        "con3": "Contributors",
        "schol1": "See all",
        "schol2": "school resources",
        "kuaisu": "Understand quickly",
        "text1": "An indispensable study partner",
        "text2": "An online educational question set learning platform that provides learning materials from colleges and universities in North America. You can  find relevant content based on the name of the school or course easily.",
        "text3": "Why do people choose CourseWhale?",
        "text4": "More powerful, Stronger, more diverse, more professional, more intimate",
        "text5": "More powerful",
        "text6": "Learning resources are highly shared, covering a variety of exercises for various subjects and courses, and customized services can also be added",
        "text7": "More diverse",
        "text8": "You can be a learner  of content terminal or an initial contributor to the content,  who can enjoy the learning results immediately",
        "text9": "More professional",
        "text10": "Strike home to the core of the problem,  and make higher quality content to meet various demand",
        "text11": "More intimate",
        "text12": "Push content based on your major and discipline to avoid the secondary search; Customized services can make you feel at ease and enrich your life of studying abroad",
        "text13": "Our mission is to help students practice and master evertthing they learn"
    },
    "schools": {
        "schools1": "Search learning resources by school",
        "schools2": "Find the learning resources required for all courses. We have millions of study documents, questions and answers as well as tutorial questions to help you learn.",
        "schools3": "Please enter the name of the school you want to inquire about",
        "schools4": "Find your school",
        "schools5": "Select from our list of schools and colleges to find the learning resources you need",
        "schools6": "View more"
    },
    "classes": {
        "classes1": "Find learning resources by course",
        "classes2": "Find the learning resources required for all courses. We have millions of study documents, questions and answers as well as tutorial questions to help you learn.",
        "classes3": "Please enter the name of the course you want to inquire about",
        "classes4": "Find your course",
        "classes5": "Select from our list of  courses to find the learning resources you need",
        "classes6": "Please enter the course you want to inquire (enter to confirm)"
    },
    "vip": {
        "title1": "Member Center",
        "title2": "4 exclusive privileges, enjoy the characteristic that only belongs to you, what are you waiting for?",
        "con1": "Core Service",
        "con2": "Enjoy massive learning resources at the same time",
        "con3": "Pinpoint your needs",
        "con4": "the Result of Orientation",
        "con5": "Hundreds of schools",
        "con6": "Relevant courses are provided an instant update",
        "con7": "Get first-hand information anytime and anywhere",
        "con8": "Target your School",
        "con9": "Submit the Course",
        "con10": "Customized Service",
        "con11": "Interactive Learning",
        "con12": "Improve together",
        "con13": "Contribute together",
        "con14": "Share together",
        "zhaomu1": "Membership recruitment plan",
        "zhaomu2": "8 per month",
        "zhaomu3": "Member Activities",
        "zhaomu4": "Organize group membership discount activities on 8 days every month",
        "zhaomu5": "Group recharge for 3 people can enjoy a 5% discount",
        "zhaomu6": "A group of 5 people can enjoy 10% discount and so on",
        "join": "Join now"
    },
    "upload": {
        "nav1": "Edit the school",
        "nav2": "Edit the course",
        "nav3": "Edit the answer",
        "school1": "Select the university where the content is uploaded",
        "school2": "Please enter the name of the school you want to inquire about",
        "school3": "Not found? Click here to add a new school",
        "school4": "Add school",
        "school5": "No school was found",
        "school6": "Add a new university",
        "school7": "Please enter the name of the school you want to look up, for example, the University of Chicago",
        "school8": "Change the name of a school",
        "school9": "Please fill in the name of your school",
        "school10": "Change the school",
        "course1": "Select the course to upload",
        "course2": "Please enter the course name you want to inquire about",
        "course3": "Add Course",
        "course4": "Add a new course",
        "course5": "No courses were found",
        "course6": "Enter the course name you want to add, such as Photography",
        "course7": "Change the name of a course",
        "course8": "Please fill in the name of your course",
        "course9": "Modify the course",
        "cancel": "Cancel",
        "establish": "Confirm to create",
        "Modify": "Modify",
        "topic": "Save the topic",
        "addtopic": "Add a new topic",
        "optional1": "Please enter your title (optional)",
        "optional2": "Please enter your answer (optional)",
        "picture1": "Add the title picture",
        "picture2": "Add the answer picture",
        "title": "Title",
        "answer": "Answer",
        "2mb": "Only one image in jpg/png format can be uploaded at a time and no more than 2MB",
        "Edit": "Edit",
        "Delete": "Delete",
        "nothave": "Not Have",
        "bottom": "Next Step",
        "top": " Last Step",
        "title1": "Summarize, Learn, Share。",
        "title2": "Upload your learning materials through the question set sharing platform of COURSEWHALE course at any time and anywhere to help you better understand the knowledge you have learned and build a knowledge system. Moreover,  by sharing the question  set you have created, you can help other students who are studying the same subjects and courses to communicate and share their learning experience and materials, so as to achieve twice the result with half the effort.",
        "title3": "Start building your question set",
        "con1": "How to create a question set",
        "con2": "How to use the question set",
        "con3": "How to share or redeem members",
        "con1-1": "Select or create a school",
        "con1-2": "The first step is to choose the school where your question bank belongs, which will help you better distinguish the similar courses in different schools. You can search the school library to select a school, and if the school you want to upload doesn't exist, you can easily create a new school.",
        "con1-3": "Select or create a course",
        "con1-4": "Next, you need to choose a course for the question bank set. You can search for the course included in the school. If the course does not exist, you can easily set up a new course.",
        "con1-5": "Upload question bank information",
        "con1-6": "According to the format of current mainstream online courses and the classification of weekly courses, you can choose the number of weeks of courses and upload your own course materials, including but not limited to Assignments, discussion, quiz, etc. When uploading any materials, you should pay attention to protect your privacy from being disclosed.",
        "con2-1": "one's own question set",
        "con2-2": "The set of self-created question set can be found in my contribution in the personal center.  All the information you have uploaded, including school, course and question set, will be displayed here. The unreviewed information will be private. You can check the review status of the information here at any time.",
        "con2-3": "Find other's question set",
        "con2-4": "You can quickly locate the question set you need by browsing the school and its curriculum. You can also search for keywords to do a site-wide search, but it will show you anything related to the keyword, so we recommend using the exact soso to find the set of questions you need.",
        "con2-5": "Focus on or evaluate the question set",
        "con2-6": "Because of the special structure of the question set, each user may update the question set at any time, so the best way is to follow a question bank set, so that we will inform you when there is new information uploaded to the question  set. You can also use the comment and comment system to help filter out better question sets.",
        "con3-1": "Open question  set",
        "con3-2": "After uploading the question set, it will be submitted to the administrator for manual review. Normally, the review process will last 1-3 working days. Please do not upload any content irrelevant to the course in the question bank collection. After successful approval, the question set will be open to all paying users. You can also hide your question  set at any time.",
        "con3-3": "Share question set",
        "con3-4": "If your question set has the exact name of the school and the course, users all over the Internet can search for your question set, or you can  share the question set page directly through social media or links, so that your friends or others in need can directly access your question set.",
        "con3-5": "Integral system of question set",
        "con3-6": "According to the number of views, searches and comments of the question bank set you upload, all your question sets can  provide you with points continuously, which can be used to redeem the member's time or withdraw at a certain proportion, and serve as our reward mechanism for every user who is willing to share and have the spirit of dedication.",
        "con4-1": "The improvement of the CourseWhale is attributed to each contributor",
        "con4-2": "The core of the CourseWhale is the spirit of sharing, so we will continue to focus on and optimize the content sharing function to help more people to join the learning and sharing more easily. We will also ensure that every contributor gets the feedback they deserve, not just for the joy of helping others, but also for the practical rewards we offer to encourage everyone.",
        "con4-3": "If you do not understand anything in the process of sharing the learning materials, please contact us through the question feedback in the lower right corner, or through email."
    },
    "personal": {
        "nav1": "Fast track",
        "nav2": "Personal Information",
        "nav3": "Modify Information",
        "nav4": "Change Password",
        "nav5": "Notification Information",
        "nav6": "My contribution",
        "nav7": "My follows",
        "nav8": "Become a Member",
        "nav9": "Purchase Records"
    },
    "basic": {
        "con1": "Email",
        "con2": "Account Type",
        "con3": "Member",
        "con4": "Expiration Date",
        "con5": "Name",
        "con6": "Gender",
        "con7": "Telephone Number",
        "con8": "School",
        "con9": "Birthday",
        "con10": "Whale Coin",
        "con11": "Exchange Membership",
        "con12": "You will pay 500 Whale Coins for one month membership, do you want to continue?",
        "con13": "Cancel",
        "con14": "Yes",
        "con15": "You can send the following address to your friends to register as a website user, and we will send you and your friends get 7 days VIP! Enjoy unlimited browsing!",
        "con16": "Upgrade to premium membership to obtain more.",
        "con17": "Upgrade now",
        "con19": "Paste",
        "con20": "Your mailbox has not been verified,",
        "con21": "click here",
        "con22": "to verify your email to get 7-day membership, and open the function of inviting friends to continue to get 7-day membership!"
    },
    "modified": {
        "con1": "Nickname",
        "con2": "Cellphone",
        "con3": "School",
        "con4": "Gender",
        "con5": "Male",
        "con6": "Female",
        "con7": "Birthday",
        "con8": "Modify Data"
    },
    "changePassword": {
        "con1": "The original password",
        "con2": "The new password",
        "con3": "Confirm password"
    },
    "inform": {
        "con1": "No data",
        "con2": "Reply to you",
        "con3": "View"
    },
    "award": {
        "con1": "Date",
        "con2": "The project you created",
        "con3": "Type",
        "con4": "Condition",
        "con5": "Operation",
        "con6": "Queation Set",
        "con7": "Curriculum",
        "con8": "School",
        "con9": "Uncreated",
        "con10": "Unchecked",
        "con11": "Checked",
        "con12": "new and unchecked",
        "con13": "Revision not reviewed",
        "con14": "Edit",
        "con15": "Delete",
        "con16": "Prompt",
        "con17": "The operation will  delete the question  set permanently, continue?",
        "con18": "Successfully delete school",
        "con19": "Successfully delete courses",
        "con20": "Successfully delete question set",
        "con21": "The operation will permanently delete the school, do you want to continue?",
        "con22": "This action will permanently delete the course. Do you want to continue?"
    },
    "attention": {
        "con1": "Courses you follow",
        "con2": "Question set you follow",
        "con3": "Unfollow",
        "con4": "Courses of no immediate concern",
        "con5": "There is no question bank set of concern"
    },
    "myvip":{
      "con1":"Month",
      "con2":"Original cost",
      "con3":"Confirm the payment",
      "con4":"Agreed and accepted CourseWhale membership terms of service"
    },
    "orderHistory":{
      "con1":"Date of Purchase",
      "con2":"Month of Purchase",
      "con3":"Amount of purchase",
      "con4":"Currency type",
      "con5":"No data"
    },
    "footer":{
      "con1":"Function",
      "con2":"Help",
      "con3":"Introduction",
      "con4":"Home Page",
      "con5":"School Resources",
      "con6":"Course Resources",
      "con7":"Register",
      "con8":"Help Center",
      "con9":"Code of Conduct",
      "con10":"Clause",
      "con11":"About us",
      "con12":"News",
      "con13":"Position"
    },
    "Public":{
      "con1":"All the school",
      "con2":"The current school",
      "con3":"The school curriculum",
      "con4":"The current course"
    },
    "university":{
      "con1":"School Information",
      "con2":"Curriculum",
      "con3":"All Curriculum",
      "con4":"Please enter the course you would inquire (enter to confirm)",
      "con5":"Question set",
      "con6":"Not find the school you need? Want more tutoring services?",
      "con7":"Scan the two-dimensional code to add the CourseWhale partner's CourseWhale academic tutoring",
      "con8":"customer service WeChat",
      "con9":"Solve any academic problems!"
    },
    "classesDetail":{
      "con1":"Follow",
      "con2":"School",
      "con3":"Professor",
      "con4":"Remsrk",
      "con5":"Question set",
      "con6":"Question  set  is shared by students from all schools!",
      "con7":"The question set is checking!",
      "con8":"Score",
      "con9":"Course Name",
      "con10":"School Name",
      "con11":"Not find the course  you need? Want more tutoring services?",
      "con12":"Scan the two-dimensional code to add the CourseWhale partner's CourseWhale academic tutoring",
      "con13":"customer service WeChat",
      "con14":"Solve any academic problems!",
      "con15":"Visit",
      "con16":"Personal data",
      "con17":"Focus on the question bank set",
      "con18":"Unfollow the question bank set",
      "con19":"Focus on success",
      "con20":"Unfollow",
      "con21":"Please log in and proceed!"
    }
}