<style>
.termsOfServices {
  width: 100%;
  height: 100%;
  padding-bottom: 276px;
  position: relative;
}
.tos-con {
  width: 970px;
  margin: 0 auto;
  border-color: #e1e1e1;
  padding-top: 60px;
  padding-bottom: 60px;
}
.tos-title {
  margin-top: 16px;
  margin-bottom: 16px;
  font-weight: 700;
}
.tos-text {
  font-size: 14px;
  color: #222;
  margin-bottom: 8px;
  text-indent: 25px;
}
</style>


<template>
  <div class="termsOfServices">
    <div v-title data-title="条款-CourseWhale"></div>
    <Nav></Nav>
    <div class="SB-Nav">服务条款</div>
    <div class="tos-con">
      <!-- <p class="tos-title">服务条款</p> -->
      <p
        class="tos-text"
      >CourseWhale平台网站（下文称为“服务”）是由 CourseWhale平台（下文称为 "CourseWhale平台"）负责经营的托管服务。任何服务的使用行为均受以下服务条款与条件（“服务条款”或“条款”）、CourseWhale平台 隐私政策、CourseWhale平台 社区准则，以及 CourseWhale平台 荣誉准则所管辖，上述相关文件均以引用方式纳入此类服务条款。若使用服务，即代表您接受此类服务条款。</p>
      <p class="tos-text">
        1.
        <b>适用性</b>:若被禁止，服务则不适用。服务的目标人群为 13 周岁以上的用户，但面向所有年龄段的用户开放。对于 13 周岁或未满 13 周岁的儿童（或当地法律默许的其他年龄用户），CourseWhale平台 提供移除部分功能后的限制功能组合和网站体验。通过使用服务，您声明并保证 (a) 您提交的所有注册信息均真实、准确；(b) 您将保持此类信息的准确性；且 (c) 您使用服务的行为不违反任何适用法律或法规。
      </p>
      <p class="tos-text">
        2.
        <b>您的 CourseWhale平台 帐户和数据</b>:如果创建服务帐户，您将负责维护您的帐户和数据的安全性，且您对该帐户名下的所有活动承担全部责任。帐户为个人，而非组织性质，仅供单独个人使用。您不得与任何其他人员共用帐户。您必须立即告知 CourseWhale平台，说明任何未授权使用您的数据、您的帐户或任何其他违反安全规定的行为。CourseWhale平台 不会为您的任何行为或疏忽承担责任，包括任何由此类行为或疏忽导致的任何形式的任何损害。CourseWhale平台 可能时常为您的数据设置储存限制，或采取任何其他我们认为管理服务所需的适当措施。CourseWhale平台 还有可能时常更改其提供商业内容或展示广告的政策，且可能不作另行通知。
      </p>
      <p class="tos-text">
        3.
        <b>升级会员资格</b>。用户可以选择为其 CourseWhale平台 帐户购买其他功能（“升级会员资格”）。可通过以下方式之一购买升级会员资格：(i) 支付经常性订阅费；或者 (ii) 预付费，从而让自己可在特定时段（“预付时段”）内进行访问。下述条款管辖您对这些计划的参与情况。
      </p>
      <p class="tos-text">
        4.
        <b>预付会员期限</b>:如果采用预付时段方式购买升级会员资格，将在预付时段结束后自动终止。
      </p>
      <p class="tos-text">
        5.
        <b>由您取消订阅</b>:如果您购买的是经常性升级会员资格订阅，则可以随时结束升级会员资格。当您选择结束升级会员资格订阅时，在下一个自动续订日期将不会续订该会员资格订阅。在此日期之前，您可以继续享受升级会员资格福利，之后您的帐户将自动降级。
      </p>
      <p class="tos-text">
        6.
        <b>由我们取消</b>:不管有没有提前通知，我们可以出于任何原因随时取消您的升级会员资格。
      </p>
      <p class="tos-text">
        7.
        <b>退款</b>:除非法律要求，否则直接通过 CourseWhale平台 购买升级会员资格恕不退款。通过其他平台购买升级会员资格则受此类平台退款政策的管辖。CourseWhale平台 不对此类平台政策负责。
      </p>
      <p class="tos-text">
        8.
        <b>价格变动</b>:CourseWhale平台 可以不时地对变更升级会员资格的价格。CourseWhale平台 会提前向您传达有关价格变动的信息，如果适用，还会说明如何接受这些变动。针对升级会员资格的价格变动将在价格变动日期后的下一个订阅期开始时生效。在当地法律允许的情况下，您在价格变动生效后继续维护您升级后的 CourseWhale平台 会员资格即表明您接受新价格。如果您不同意价格变动，则有权拒绝该变动，只需在价格变动生效之前取消订阅升级会员资格即可。因此，请务必认真阅读有关价格变动的任何此类通知。
      </p>
      <p class="tos-text">
        9.
        <b>高级内容</b>:用户可以选择购买或获取 CourseWhale平台 的商业内容（下文称“高级内容”）。获取高级内容可以通过网站留言或者邮箱联系客服，我们会在24小时之内回复您。
      </p>
      <p class="tos-text">
        10.
        <b>内容订阅</b>:获取高级内容是内容订阅的延伸服务，受购买流程期间所述之条款的管辖，且您需要遵守其中的限制。
      </p>
      <p class="tos-text">
        11.
        <b>许可证</b>:如果购买内容订阅服务获取高级内容，您可以在指定时段内访问收录的资料。您仅可以出于个人及教育之目的使用高级内容（“个人使用”）。每个帐户必须各自购买内容订阅，而且帐户不得由多个用户共享。
      </p>
      <p class="tos-text">
        12.
        <b>限制</b>:您不得将高级内容用于任何商业之目的。亦即，您不得出售或将其用于广告或营销之目的，或者以任何与业务或营利活动相关之其他方式使用此类内容。您不得发布，或以其他方式在任何网站提供高级内容。您不得将高级内容分享、发送、出售、转授权或转让给他人。
      </p>
      <p class="tos-text">
        13.
        <b>退款</b>:除非法律要求，否则直接通过 CourseWhale平台 购买升高级内容订阅恕不退款。通过其他平台购买高级内容订阅则受此类平台退款政策的管辖。CourseWhale平台 不对此类平台政策负责。
      </p>
      <p class="tos-text">
        14.
        <b>贡献者的责任</b>:如果您通过讨论板创建集合、评论，发布资料至服务，在服务上发布链接，或借由服务以其他方式提供资料（下文统称为“内容”），您将为此类内容的组成和任何由其导致的损害承担全部责任。无论此类内容为文本、图像、音频文件、电脑软件，或其他任何 CourseWhale平台 储存数据的格式，上述规定均可适用。
      </p>
      <p class="tos-text">
        15.
        <b>被禁内容</b>:您仅可将与教育及学习相关的内容发布至服务。以下是禁止在服务上或通过服务发布的内容示例。CourseWhale平台 保留经自主裁量，对任何其认为违反此条款的人员进行调查与提起适当法律诉讼的权利，包括但不限于，删除服务上冒犯性的内容，终止此类违反人员的帐户，或寻求其他法律救济等。被禁内容包括，但不限于，CourseWhale平台 经自主裁量认为：
      </p>
      <p class="tos-text">
        15.1
        公然冒犯且宣传种族主义、偏执观点、仇恨或对任何人群或个人造成实际伤害的任何类型之内容
      </p>
      <p class="tos-text">
        15.2
        骚扰或主张对其他人进行骚扰之内容
      </p>
      <p class="tos-text">
        15.3
        以性侵或暴力形式攻击其他人之内容
      </p>
      <p class="tos-text">
        15.4
        包含性暗示、过于暴力，或冒犯性主题之内容
      </p>
      <p class="tos-text">
        15.5
        向未满 18 周岁的任何人员征求个人信息之内容
      </p>
      <p class="tos-text">
        15.6
        公开发布相关信息，让任何人员有隐私或安全风险之内容
      </p>
      <p class="tos-text">
        15.7
        未征得同意，发布包含其他人员信息之内容
      </p>
      <p class="tos-text">
        15.8
        违反任何人员的隐私权、公开权、版权、商标权、合约权或其他任何权利之内容
      </p>
      <p class="tos-text">
        15.9
        包含或宣传明知为错误或误导性的信息，或宣传辱骂、威胁、淫秽、恶意中伤或诽谤的非法活动或行为之内容
      </p>
      <p class="tos-text">
        15.10
        包含或宣传他人版权作品的非法或未授权副本之内容
      </p>
      <p class="tos-text">
        15.11
        征求其他用户密码或个人身份识别信息以用于商务或非法目的之内容
      </p>
      <p class="tos-text">
        15.12
        涉及传送垃圾邮件、连环信、未申请即大量寄送的邮件或即时消息，或滥发邮件之内容
      </p>
      <p class="tos-text">
        15.13
        推广或宣传任何犯罪活动或企图，或提供关于非法活动的教导信息之内容，包括但不限于，制作或购买非法武器，侵害他人隐私，提供或编写电脑病毒等
      </p>
      <p class="tos-text">
        15.14
        未经征得 CourseWhale平台 的书面同意，涉及商务活动和/或销售之内容，例如，比赛、抽奖、以物易物、广告或金字塔式传销等
      </p>
      <p class="tos-text">
        15.15
        违反任何及全部适用法律或法规之内容
      </p>
      <p class="tos-text">
        16.
        <b>被禁活动</b>:在使用服务时，您仅可参加与教育及学习相关之活动。以下是禁止在服务上从事活动的类型示例。CourseWhale平台 保留经自主裁量，对任何其认为违反此条款的人员进行调查与提起适当法律诉讼的权利，包括但不限于，终止您的帐户和/或服务的使用权限，向相关政府机关（如执法部门等）举报您的行为，或寻求其他法律救济等。被禁活动包括，但不限于：
      </p>
      <p class="tos-text">
        16.1
        犯罪或侵权活动，包括散布含有儿童色情、欺诈、非法交易信息的淫秽内容，毒品买卖、赌博、骚扰、暗地跟踪，以及发送垃圾信息、病毒或其他有害文件，侵害版权、专利权或盗窃商业机密等
      </p>
      <p class="tos-text">
        16.2
        规避或修改、尝试规避或修改，以及鼓励或协助其他人员规避或修改作为服务之一部分的任何安全技术或软件
      </p>
      <p class="tos-text">
        16.3
        冒名顶替或尝试冒名顶替其他用户、个人或实体
      </p>
      <p class="tos-text">
        16.4
        任何时间使用其他用户的帐户、用户名或密码，或将您的密码透露给任何第三方，或允许任何第三方访问您的帐户
      </p>
      <p class="tos-text">
        16.5
        出于骚扰、虐待，或伤害其他人员或实体之目的，使用或尝试使用任何服务的信息
      </p>
      <p class="tos-text">
        16.6
        涉及使用病毒、机器人程序、网络蠕虫或任何其他电脑代码、文件或程序，中断、损毁或限制任何电脑软件或硬件之功能，或以其他方式允许未授权使用或访问电脑或电脑网络的活动
      </p>
      <p class="tos-text">
        16.7
        任何系统的自动使用行为，包括但不限于，使用脚本创建或发布内容等
      </p>
      <p class="tos-text">
        16.8
        干扰、中断，或对服务、服务相关的网络或服务制造不必要的负担
      </p>
      <p class="tos-text">
        16.9
        在服务上展示未经授权的商业广告，或收取第三方的付款或其他有价物品，从而未经授权或许可便代表该第三方使用服务
      </p>
      <p class="tos-text">
        16.10
        未经其他独立协议专门许可而出于任何商业目的，复印、复制、拷贝、销售、转售、交换或利用服务提供的内容和/或功能的任何一部分，或访问服务提供的内容和/或功能
      </p>
      <p class="tos-text">
        16.11
        使用服务时未遵守任何及所有适用法律或法规
      </p>
      <p class="tos-text">
        17.
        <b>内容声明和担保</b>:通过提供内容，您声明并保证:
      </p>
      <p class="tos-text">
        17.1
        下载、复制和使用内容不会违反所有权，包括但不限于，任何第三方的版权、专利、商标或商业机密等权利
      </p>
      <p class="tos-text">
        17.2
        若您的雇主拥有您所创建内容的知识产权，您需要获得 (i) 雇主就发布或提供内容的允许，此类内容包括但不限于任何软件；或 (ii) 雇主针对内容或内容相关所有权利的弃权书
      </p>
      <p class="tos-text">
        17.3
        您已完全遵守任何与内容相关的第三方许可规定，并采取一切必要之措施，以成功将任何必要之条款传达给终端用户
      </p>
      <p class="tos-text">
        17.4
        内容不含有或安装任何病毒、网络蠕虫、恶意软件、木马程序或其他任何有害或有破坏性的资料
      </p>
      <p class="tos-text">
        17.5
        内容非垃圾邮件，且不含有不道德或多余的商务资料，以图实现增加第三方网站流量、提升第三方网站的搜索引擎排名、诱发非法行为（如网络钓鱼）或就资料的来源误导收件人（如电子欺诈）之目的
      </p>
      <p class="tos-text">
        17.6
        非淫秽或诽谤内容，且不违反任何第三方的隐私或公开权
      </p>
      <p class="tos-text">
        17.7
        若内容含有电脑代码，您已根据 CourseWhale平台 或其他要求对其进行准确分类并/或描述资料的类型、性质、使用和效果
      </p>
      <p class="tos-text">
        18.
        <b>授权</b>:通过提交内容或任何其他资料至 CourseWhale平台 以包括在服务之内或出于任何其他之目的，如发布学习集，参与调查或向 CourseWhale平台 发送电子邮件等，您赋予 CourseWhale平台 通过任何和全部（现有或以后开发的）媒体或分发方式使用、拷贝、复制、处理、改编、修改、出版、传输、展示与分发此类内容的全球性、永久性之免版税授权（及转授权）。其他由 CourseWhale平台，或与 CourseWhale平台 合作的其他公司或个人不会就使用您所提交、发布或以其他方式提供给 CourseWhale平台 或通过服务披露之内容或资料向您支付报酬。
      </p>
      <p class="tos-text">
        19.
        <b>嵌入式功能</b>:若在您的网站上使用 CourseWhale平台 嵌入式功能，您不得修改，以其为基础构建，或拦截任何功能或其部分功能，包括但不限于，返回 CourseWhale平台 网站的反向链接等,如果您使用 CourseWhale平台 API，即表示您同意关於第三方开发人员与内容和服务互动方式的。
      </p>
      <p class="tos-text">
        20.
        <b>服务访客的责任</b>:CourseWhale平台 未审查，也无法审查发布到服务的全部内容，因此也无法对此类资料的内容、使用或效果承担责任。通过服务运营，CourseWhale平台 并不声明或暗示其认同发布在服务上的资料，或认为此类资料准确、实用或无害。您有责任采取必要的预防措施，针对病毒、网络蠕虫、木马程序和其他有害或破坏性资料对自己及您的电脑系统进行保护。服务可能包含冒犯性、不雅或其他令人反感的资料，且内容中也可能会出现技术性、有悖于事实或其他偏差、印刷差错和其他错误。另外，服务还有可能包含违反或侵害第三方知识产权和其他所有权的资料，或对其进行下载、复制和使用须受其他已阐明或未阐明的条款与条件管辖。CourseWhale平台 不会因服务访客使用，或此类访客下载其上发布内容所导致的任何损害承担任何责任。若访客发现内容或其他资料违反此类条款或 CourseWhale平台 社区准则，我们鼓励其使用服务的举报功能将此类资料报告给 CourseWhale平台。
      </p>
      <p class="tos-text">
        21.
        <b>其他网站发布的内容</b>:我们未审查，也无法审查全部内容，包括 CourseWhale平台 链接至和链接至 CourseWhale平台 的网站和网页上提供的电脑软件等。CourseWhale平台 对此类第三方网站和网页没有任何控制权限，因此对他们的内容或您的使用行为不承担责任。链接至第三方网站或网页，并不代表 CourseWhale平台 声明或暗示其认可该网站或网页。您有责任采取必要的预防措施，针对病毒、网络蠕虫、木马程序和其他有害或破坏性资料对自己及您的电脑系统进行保护。CourseWhale平台 不会因您使用第三方网站和网页所导致的任何损害承担任何责任。
      </p>
      <p class="tos-text">
        22.
        <b>版权侵害和 DMCA 政策</b>:CourseWhale平台 尊重他人的知识产权。若您认为 CourseWhale平台 上或链接至的资料侵害您的版权，我们建议您通知 CourseWhale平台 并协商后续停止损害您的版权行为。CourseWhale平台 将针对所有此类通知作出反应，包括在必要或适当的情况下删除侵权内容，或禁用所有转至侵权内容的链接。如果访客一次或重复侵害 CourseWhale平台 或他人的版权或其他知识产权，CourseWhale平台 可以经自行裁量停止或拒绝其访问或使用服务。在此种情况下，CourseWhale平台 没有义务退还该用户在之前支付给 CourseWhale平台 的任何金额之费用。
      </p>
      <p class="tos-text">
        23.
        <b>商标</b>:与 CourseWhale平台 或其服务相关的 CourseWhale平台、CourseWhale平台.com、CourseWhale平台 徽标，以及所有其他商标、服务标记、图片和徽标都是 CourseWhale平台 或 CourseWhale平台 授权商的商标或注册商标。服务相关的其他商标、服务标记、图片和徽标可能是其他第三方的商标。您的服务使用行为并未赋予您复制或以其他方式使用任何 CourseWhale平台 或第三方商标的权利或许可。音频文件不得作为一项服务出售、再分发，或提供给其他人员。
      </p>
      <p class="tos-text">
        24.
        <b>更改服务及条款</b>:服务（包括但不限于所提供的所有内容、产品及会员功能、任何与全部 CourseWhale平台 政策，以及此类条款与条件）可能经 CourseWhale平台 自行裁量发生更改，并不另行通知。您须受任何此类更新或更改约束，包括但不限于，影响此类服务条款的更新或更改，因此，您应该定期查看此类服务条款。
      </p>
      <p class="tos-text">
        25.
        <b>CourseWhale平台、其供应商和授权商的担保限制</b>:除非以其他方式明确声明，服务所发布或提供的所有内容均“按原样”提供，且 CourseWhale平台 及其供应商和授权商并不作明确或暗示声明或担保，包括但不限于，适销性、适用于特定目的、所有权，或不侵害产权之担保。您理解并同意经自行裁量下载或以其他方式获取服务的内容或相关服务，并自行承担全部风险，且 CourseWhale平台 及其供应商和授权商并不因下载此类内容或使用服务所导致的任何电脑系统或数据损害承担任何义务或责任。部分司法管辖区不允许排除暗示担保，因此上述有些规定可能对您不适用。
      </p>
      <p class="tos-text">
        26.
        <b>CourseWhale平台、其供应商和授权商的责任限制</b>:除非以其他方式明确声明，无论在何种情况下，任何使用服务，或其内容，或任何超链接至的网站导致您或任何其他方因此遭受任何直接、间接、特别、继发或典型损害，不管其索赔的依据或性质为何，CourseWhale平台、其供应商和授权商对您和任何其他方均不承担任何责任，此类损害包括但不限于，任何利润损失、业务中断、数据丢失或其他损害，即使 CourseWhale平台、其供应商或授权商曾经被明确提醒发生此类损害的可能性也不例外。您对 CourseWhale平台、其供应商和授权商要求的因使用服务或其内容，或任何超链接至的网站而导致或与其相关的任何及全部索赔总额不得超过申诉索赔行为前 12 个月内您实际支付给 CourseWhale平台 的金额总额。部分司法管辖区可能不允许排除或限制特定偶发或继发损害的责任，因此上述有些限制可能对您不适用。各方同意本条款，即第 10 条，对风险的合理分配作了明确阐释。
      </p>
      <p class="tos-text">
        27.
        <b>与CourseWhale平台产生纠纷</b>:如果您和 CourseWhale平台 由于此类服务条款，或您使用服务的行为，或者与之相关的原因产生任何纠纷，此时将适用下述规则。请仔细阅读此部分内容，它可能对您的法定权利造成重大影响，包括您向法院提出上诉，以及向陪审团陈述主张的权利等。
      </p>
      <p class="tos-text">
        28.
        <b>约束仲裁</b>:任何由于此类条款，或您使用服务的行为，或者与之相关的原因产生任何纠纷将通过商务仲裁协会按照其商务仲裁规则进行的约束仲裁解决。您有责任仅依照规定支付任何上诉、行政或仲裁员费用。在规定允许的范围内，仲裁员可以将成本、费用及其他开支，包括合理之律师费等，判定给胜诉方。仲裁达成的决定为最终判定，且具有约束力，此类决定可由任何有管辖权的法院做成判决。您了解仲裁中无法官或陪审团，也无法在仲裁期间享有其他程序性权利，如搜证和上诉权等。您和 CourseWhale平台 知悉且自愿同意放弃各自享有的由法官或陪审团进行审判的权利，以及在法院审理案件之权利。
      </p>
      <p class="tos-text">
        29.
        <b>解决纠纷将采取个案原则</b>:您和 CourseWhale平台 知悉且自愿同意放弃各自享有的提起或参与共同、集体、合并或代理诉讼或仲裁的权利。尽管有此条款之规定，任何一方可以向相关管辖权的法院寻求强制或其他平等救济，以便于在仲裁结束前保护其知识产权。
      </p>
      <p class="tos-text">
        30.
        <b>一般声明和担保</b>:您声明并担保您在使用服务时会遵守《CourseWhale平台 的隐私政策》、此类服务条款，以及任何适用的法律和法规，包括但不限于所在国家/地区、州/省、市或其他政府管辖区域关于网上行为和可接受内容的任何当地法律或法规，其中包括所有关于将技术数据输出美国或您所在国家/地区的适用法律，以及其他任何适用的政策或条款与条件。
      </p>
      <p class="tos-text">
        31.
        <b>赔偿责任</b>:在因您使用我们的服务（包括但不限于，任何违反此类条款与条件中所包含任何生命和担保的行为）引发任何及所有索赔并产生相关费用时，包括律师费等，您同意为 CourseWhale平台、其合约商和授权商，及其董事、官员、雇员和代理人进行辩护，使其免于赔偿及遭受损害。
      </p>
      <p class="tos-text">
        32.
        <b>其他条款</b>:在因您使用我们的服务（包括但不限于，任何违反此类条款与条件中所包含任何声明和担保的行为）引发任何及所有索赔并产生相关费用时，包括律师费等，您同意为 CourseWhale平台、其合约商和授权商，及其董事、官员、雇员和代理人进行辩护，使其免于赔偿及遭受损害。
      </p>
      <p class="tos-text">
        33.
        <b>可分割性</b>:若此类服务条款中的任何部分无效或不可执行，则依据起草者的最初意图对该部分加以解读，而其余部分保持完全有效。
      </p>
      <p class="tos-text">
        34.
        <b>非弃权</b>:任何方在任何情况下对此类服务条款中的任何条款或条件，或任何违反本服务条款的行为弃权，并不代表其将对此类条款或条件，或任何随后的违约行为弃权。
      </p>
      <p class="tos-text">
        35.
        <b>权利转让</b>:若对方认可并同意受其条款约束，您可以将此类服务条款规定的权利转让给任何方。CourseWhale平台 可以无条件转让此类服务条款规定的权利。此类服务条款将保持约束力，并保障各方，其继任者和被认可受让人之权益。
      </p>
      <p class="tos-text">
        36.
        <b>条款效力</b>即使在您关闭帐户，或停止使用服务以后，此类条款依然有效。
      </p>
      <p class="tos-title">隐私声明</p>
      <p
        class="tos-text"
      >CourseWhale平台注重对您的个人隐私的保护。有时候我们需要某些信息才能为您提供您请求的服务，本隐私权声明解释了这些情况下的数据收集和使用情况。本隐私权声明适用于CourseWhale平台网站的所有相关服务。</p>
      <p class="tos-text">
        1.
        <b>您个人信息的搜集</b>:当我们需要能识别您身份的信息（个人信息）或者可以与您联系的信息时，我们会征求您的同意。通常，在您注册CourseWhale平台在线服务时，我们会请求您提供这些信息。CourseWhale平台搜集的信息通常仅限于您的姓名、性别、年龄、出生日期、身份证号、家庭住址、教育程度、就读/毕业院校、公司情况、所属行业、兴趣爱好等。
      </p>
      <p class="tos-text">
        2.
        <b>控制您的个人信息</b>:CourseWhale平台会在法律要求或符合CourseWhale平台网站的相关服务条款的情况下透露您的个人信息，或者有充分理由相信必须这样做才能：(a) 满足法律的明文规定，或者符合CourseWhale平台适用的法律程序；（b）符合CourseWhale平台网站相关服务条款；(c) 保护CourseWhale平台及其系列 Web 站点的权利或财产，以及 (d) 在紧急情况下保护CourseWhale平台员工、CourseWhale平台产品或服务的用户或大众的个人安全,CourseWhale平台不会未经允许将这些信息与第三方共享，本声明已经列出的情况除外。
      </p>
      <p class="tos-text">
        3.
        <b>您个人信息的安全</b>:严格保护您的个人信息的安全。我们使用各种安全技术和程序来保护您的个人信息不被未经授权的访问、使用或泄漏。如果您对我们的隐私保护有任何置疑，请email至我们网站的官方联系方式。
      </p>
      <p class="tos-text">
        4.
        <b>Cookie 的使用</b>
        :CourseWhale平台使用 Cookie 来帮助您实现您的联机体验的个性化。Cookie 是由网页服务器存放在您的硬盘中的文本文件。Cookie 不能用来运行程序或将病毒递送到您的计算机中。指定给您的 Cookie 是唯一的，它只能由将 Cookie 发布给您的域中的 Web 服务器读取。
        Cookie 的主要用途之一是提供一种节约时间的实用功能。例如，如果您将CourseWhale平台的网页个性化，或在CourseWhale平台网站上注册，Cookie 会帮助CourseWhale平台在您后续访问时调用您的特定信息。这样可以简化记录您的个人信息（例如礼品寄送地址、首选电子邮件地址等）的流程。当您返回到CourseWhale平台时，CourseWhale平台可以调出您以前所提供的信息，使您能够容易地使用您自定义的CourseWhale平台功能。CourseWhale平台允许那些在我们网页上发布广告的公司到用户电脑上设定或取用Cookie。其他公司将按其自订的隐私权政策而非本政策使用 Cookie。
        CourseWhale平台在进行与其服务相关的工作时，会使用其他网络进入我们的网站提取 Cookie。
        您可以接受或拒绝 Cookie。大多数 Web 浏览器会自动接受 Cookie，但您通常可根据自己的需要来修改浏览器的设置以拒绝 Cookie。如果选择拒绝 Cookie，那么您可能无法完全体验所访问的CourseWhale平台服务或网站的互动功能。
      </p>
      <p class="tos-text">
        5.
        <b>在CourseWhale平台网站中使用</b>:CourseWhale平台通过在其网站上使用网络 beacons，计算用户访问数量，并通过访问 cookie 辨认注册用户。
        CourseWhale平台通过得到的 cookies 信息，可以在CourseWhale平台网站提供个性化服务。
        CourseWhale平台网页还可能包含第三方合作伙伴所放置的 Web beacon，以便汇总统计信息以帮助确定
      </p>
      <p class="tos-text">
        6.
        <b>第三方广告网络的使用</b>:您在CourseWhale平台网页上所看到的大多数联机横幅广告是由CourseWhale平台展示的。
        此外，CourseWhale平台还允许其他公司，即所谓的第三方广告服务器或广告网络，在CourseWhale平台网页上展示广告。其中一些广告网络会在您的计算机上放置一个永久性的 Cookie。这样便可使广告网络在每次向您发送联机广告时识别出您的计算机。这样，广告网络会搜集到有关您或使用您计算机的其他人在何处看见他们的广告，以及确定哪些广告被点击。这些信息使得广告网络能够发布他们认为将是您最感兴趣的广告。CourseWhale平台无权访问或控制可能由第三方广告服务器或广告网络放置的 Cookie。
      </p>
      <p class="tos-text">
        7.
        <b>访问您的个人信息</b>:我们为您提供了多种途径以确保您的个人信息是准确及时的。如果您在CourseWhale平台网站上注册，您可以随时查阅或编辑您提交给CourseWhale平台网站的个人信息，您也可以随时删除您提交给CourseWhale平台网站的个人信息。
      </p>
      <p class="tos-text">
        8.
        <b>关于免责</b>
        :就下列相关事宜的发生，CourseWhale平台不承担任何法律责任：
        CourseWhale平台根据法律规定或相关政府的要求提供您的个人信息；
        由于您将用户密码告知他人或与他人共享注册帐户，由此导致的任何个人信息的泄漏，或其他非因CourseWhale平台原因导致的个人信息的泄漏；
        任何第三方根据CourseWhale平台各服务条款及声明中所列明的情况使用您的个人信息，由此所产生的纠纷；
        任何由于黑客攻击、电脑病毒侵入或政府管制而造成的暂时性网站关闭；
        因不可抗力导致的任何后果；
        CourseWhale平台在各服务条款及声明中列明的使用方式或免责情形。
        CourseWhale平台会不时更新本隐私权声明。更新时，我们还会修改隐私权声明顶部的"最近更新"的日期。
      </p>
      <p class="tos-text" style="text-align:right;color:rgb(143, 143, 143);">CourseWhale平台</p>
    </div>
    <homeFooter></homeFooter>
  </div>
</template>
<script type="es6">
import Nav from "@/components/public/nav.vue";
import homeFooter from "@/components/public/homeFooter.vue";
export default {
  name: "termsOfServices",
  components: {
    Nav,
    homeFooter
  },
  data() {
    return {
      wer: 123
    };
  },
  created: function() {
    var _this = this;
    document.documentElement.scrollTop = 0;
  },
  methods: {}
};
</script>
